docs/posts/2024-04-19-haskell-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-06 Wed 10:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Haskell, Eglot, Language Servers, and Emacs</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav>
&emsp; <a href="/index.html">Home</a>
&emsp; <a href="/about.html">About</a>
&emsp; <a href="/pubs.html">Publications</a>
&emsp; <a href="/posts.html">Posts</a>
&emsp; <a href="/posts/theindex.html">Posts by Topics</a>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Haskell, Eglot, Language Servers, and Emacs</h1>
<div id="outline-container-org56d1699" class="outline-2">
<h2 id="org56d1699"><span class="section-number-2">1.</span> Haskell Coding in Emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
Haskell is a programming language where the rate of development and the evolution of its tooling can make it challenging to love. But love it I do, even though in many ways it is the antithesis of Common Lisp. If the latter is a <i>forever language</i> it sometimes feels as if Haskell is a <i>never language</i>, because I spend so much time trying to figure out how to get it working (admittedly I am only an intermittent user) that by the time I am done, I never write any code.
</p>

<p>
But here I am once again hoping to go to <a href="https://zfoh.ch/zurihac2024/">ZuriHac 24</a>, and I would like to have a basic functioning environment by the time I get there.
</p>

<p>
The memory of the internet is long and that doesn't play well with the constantly changing tooling of emacs and Haskell. I had a lot of trouble finding contemporary guidance. These are my breadcrumbs as of April 2024 for a minimal functional set up using Emacs as the editor. 
</p>

<p>
First you need Haskell. You will have to look to your distribution for how to get that installed. I am using Archlinux. At one point it was the go to distribution for Linux users, but with a change a few years ago static to dynamic linking things stopped working smoothly. Now the go to Linux for Haskell users is probably <a href="https://nixos.org/">NixOS</a>, but that will not be a simple transition, and I think the much simpler way to go is <a href="https://www.haskell.org/ghcup/">ghcup</a>. Ghcup is a tool that allows you to install multiple versions of <code>cabal</code> (a packaging tool and more), <code>stack</code> (an alternative or even complementary packaging tool), and <code>ghc</code> the compiler. You can also switch between versions. In addition, you can use <code>ghcup</code> to get the <code>haskell language server</code> that matches each <code>ghc</code> version you install, and an <code>haskell-language-server-wrapper</code> should track the changes you make when switching between installed <code>ghc</code> versions.
</p>

<p>
Here is the warning. If you have not used <code>ghcup</code> before, and you decide to use it now clean out your old haskell installation and start with a clean slate. Then, install ghc, cabal, and a compatible <a href="https://haskell-language-server.readthedocs.io/en/latest/configuration.html#configuring-haskell-language-server">haskell-language-server</a>-wrapper using ghcup. 
</p>

<p>
<a href="https://joaotavora.github.io/eglot/">Eglot</a> is now a part of Emacs (I think it came in 29, but I am using 30.50 here). Eglot is the Emacs polyglot. It provides a consistent interface to various language servers. You can use it for all your programming languages. Here I am only looking at Haskell. If you are using modern Emacs there is nothing to install. You just <code>require</code> it. In addition, I installed <code>haskell-mode</code>. I don't know if it is necessary, but it doesn't seem to be hurting anything.
</p>

<p>
Basic <code>eglot</code> configuration was very minimal, and a lot of this is not strictly necessary. Here is the snippet in my <code>.init.el</code> file:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">use-package</span> eglot
  <span style="font-weight: bold;">:config</span>
  (add-hook 'haskell-mode-hook 'eglot-ensure)
  <span style="font-weight: bold;">:custom</span>
  (eglot-autoshutdown t)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">shutdown language server after closing last file</span>
  (eglot-confirm-server-initiated-edits nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">allow edits without confirmation</span>
  )
</pre>
</div>

<p>
Some gotchas. <b><code>PATH</code></b> Variables for both your Linux system and your Emacs installation. In order to find the tools you installed with <code>ghcup</code> your system needs to know where to look for them. Mine are in <code>~/.ghcup/bin/</code>. There are many ways to add things to the path of a Linux system, but I chose to use a method described in the <a href="https://wiki.archlinux.org/title/Environment_variables#Globally">environment variables Arch wiki page</a>. It looks like this:
</p>


<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>A function to set paths for individual users, and an example of its use.</label><pre class="src src-sh">
  set_path(){

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Check if user id is 1000 or higher</span>
    [ <span style="font-style: italic;">"$(</span><span style="font-weight: bold;">id -u</span><span style="font-style: italic;">)"</span> -ge 1000 ] || <span style="font-weight: bold;">return</span>

    <span style="font-weight: bold;">for</span> i<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"$@"</span>;
    <span style="font-weight: bold;">do</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Check if the directory exists</span>
        [ -d <span style="font-style: italic;">"$i"</span> ] || <span style="font-weight: bold;">continue</span>

        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Check if it is not already in your $PATH.</span>
        <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$PATH"</span> | grep -Eq <span style="font-style: italic;">"(^|:)$i(:|$)"</span> &amp;&amp; <span style="font-weight: bold;">continue</span>

        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Then append it to $PATH and export it</span>
        <span style="font-weight: bold;">export</span> <span style="font-weight: bold; font-style: italic;">PATH</span>=<span style="font-style: italic;">"${PATH}:$i"</span>
    <span style="font-weight: bold;">done</span>
}

set_path ~/.ghcup/bin

</pre>
</div>

<p>
You also <b>must</b> make sure your Emacs path also gets the message. I mistakenly believed that Emacs would inherit my system path, especially since I could find the programs using <code>which</code> in an <code>eshell</code> session running inside Emacs. Not so. And Emacs has different paths. There are paths for loading libraries, executing things that Emacs manages for itself, internals if you will, and then the path for system executables. This is the one we want. There is a concise little library in <code>MELPA</code> that allows you to do this <code>exec-path-from-shell</code>. If you run emacs server, as I do, as a <code>systemd --user</code> unit you will need that <code>daemonp</code> line. 
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">use-package</span> exec-path-from-shell)
(<span style="font-weight: bold;">when</span> (daemonp)
  (exec-path-from-shell-initialize))
</pre>
</div>

<p>
The next gotcha: Compiling. You can easily do this from your terminal if you wish, but it would be nice to do it inside emacs. Given some key conflicts I needed to remap the "C-c C-c" key that my muscle memory insists must be the compile command to the "haskell" compile command.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">use-package</span> haskell-mode
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> haskell-mode-map
              ((<span style="font-style: italic;">"C-c C-c"</span> . haskell-compile))))
</pre>
</div>

<p>
Penultimate gotcha: configuring the specific language server features and plugins you want to use with <code>eglot</code>.
</p>

<p>
I found this the hardest to get right, since I do not really know what all the <code>haskell-language-server</code> offers in the way of plugins, and what all the configuration variables are. The language servers use json, but emacs tends to use <code>alists</code> and <code>plists</code>, and  in this situation there is a blend. You may find a lot of trial and error is required, and the advice I read suggests doing this local to a project and not globally. In each project directory write a file <code>.dir-locals.el</code>. Emacs info has a node on directory local definitions. This is an <code>alist</code>, but the <code>eglot</code> tool looks for a <code>plist</code>, so, as an example, you end up with something like this:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Example Eglot Workspace Configuration</label><pre class="src src-elisp">((nil . ((eglot-workspace-configuration . (<span style="font-weight: bold;">:haskell</span>
                                             (<span style="font-weight: bold;">:plugins</span>
                                              (<span style="font-weight: bold;">:stan</span> (<span style="font-weight: bold;">:globalOn</span> <span style="font-weight: bold;">:json-false</span>)
                                                     <span style="font-weight: bold;">:ghcide-code-actions-fill-holes</span> (<span style="font-weight: bold;">:enabled</span> t))))))))
</pre>
</div>


<p>
Last gotcha: You need to sort of remember or figure out how <code>cabal</code> works and what it expects. I recommend for a practice project creating a directory with some name, e.g. <code>tesths</code>. Inside that directory, probably from a terminal, run <code>cabal init</code>. Then move to the <code>./app/</code> sub-directory and write your <code>Test.hs</code> file, maybe something like:
</p>

<div class="org-src-container">
<pre class="src src-haskell">module Main where 


main :: IO ()
main = putStrLn "howdy"
</pre>
</div>

<p>
<code>Cabal</code> expects a <code>main</code> for executable so just leave it like this to get started. Then you should be able to "C-c C-c" and <code>haskell-language-server-wrapper</code> will figure out to use <code>cabal</code> to build your executable. That will end up somewhere. Depending on exactly how you invoked the compilation it may be deep in  <code>.dist-newstyle</code> sub-directory or more likely stored in a "store" in a sub-directory of a parent that looks like this: <code>~/.cache/hie-bios/dist-tesths-c1e9a7a89739f25f6dd9edc617b06f68</code>.
</p>

<p>
If this doesn't work for you, hopefully it will help save you some time. And if you have a better way to do it please let me know. Thanks. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-04-19 Fri 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2024-11-06 Wed 10:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
